---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderGeometryId.InvalidGeometryId
source: html/7f5bd4c6-1403-bfa9-834b-529d713b3216.htm
---
# Autodesk.Revit.DB.BRepBuilderGeometryId.InvalidGeometryId Method

Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.

## Syntax (C#)
```csharp
public static BRepBuilderGeometryId InvalidGeometryId()
```